// Задача 41: Пользователь вводит с клавиатуры M чисел. Посчитайте, сколько чисел больше 0 ввёл пользователь.
// 0, 7, 8, -2, -2 -> 2
// 1, -7, 567, 89, 223-> 3


///////////////////////////////////////////////////////////////////////////////
///////////// вводится каждое число отдельно///////////////////////////////////
///////////////////////////////////////////////////////////////////////////////
//  Console.Write("Введите число M для определения колтчества проверяемых чисел: ");
//  int m = Convert.ToInt32(Console.ReadLine());
//  int[] arr = new int[m];
// for (int i = 0; i < m; i++)
//    {
//     Console.Write($"ВВедите {i+1} число для проверки: ");
//     arr[i] = Convert.ToInt32(Console.ReadLine());
//   }
// //проверка числа под индексом массива 
// int count = 0;
// for (int i = 0; i < arr.Length; i++)
// {
//     if (arr[i] > 0)
//         count++;
// }
// Console.Write($"Количество чисел больше 0: {count}");



//////////////////////////////////////////////////////////////////////////////
////////////////рандомный массив по длинне введенного числа///////////////////
//////////////////////////////////////////////////////////////////////////////

//  Console.Write("Введите число M для определения колтчества проверяемых чисел: ");
//  int m = Convert.ToInt32(Console.ReadLine());
//  int[] arr = new int[m];
// Random rand = new Random();
// for (int i = 0; i < arr.Length; i++)
// { 
//     arr[i] = rand.Next(-4, 5); 
// }

// Console.WriteLine(string.Join(", ", arr));
// //проверка числа под индексом массива 
// int count = 0;
// for (int i = 0; i < arr.Length; i++)
// {
//     if (arr[i] > 0)
//         count++;
// }
// Console.Write($"Количество чисел больше 0: {count}");



//////////////////////////////////////////////////////////////////////////////
////////////////Самое нормальное//////////////////////////////////////////////
//////////////////////////////////////////////////////////////////////////////
Console.Write("Введите ряд чисел, разделенных запятой: ");
string s = Convert.ToString(Console.ReadLine());
//string s = "0,2,3,-5";
int number = 0;
char[] separators = new char[] { ' ', ',' };
string[] str = s.Split(separators, StringSplitOptions.RemoveEmptyEntries);
int count = 0;
for (int i = 0; i < str.Length; i++)
 {
     number = Int32.Parse(str[i]);
      if (number > 0)
         count++;
    // Console.WriteLine(string.Join("*", str[i]));
 }
Console.Write($"Количество чисел больше 0: {count}");